BillyPocketNC/musical-waddle/penta-samd-1.7.11/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.cache=Cache
menu.speed=CPU Speed
menu.opt=Optimize
menu.maxqspi=Max QSPI
menu.usbstack=USB Stack
menu.debug=Debug

# -----------------------------------
# Penta Machine CO. Trinket M0 (SAMD21)
# -----------------------------------
penta_machine_co_trinket_m0.name=Penta Machine Co. Trinket M0 (SAMD21)

# VID/PID for Bootloader, Arduino & CircuitPython
penta_machine_co_trinket_m0.vid.0=0x239A
penta_machine_co_trinket_m0.pid.0=0x801E
penta_machine_co_trinket_m0.vid.1=0x239A
penta_machine_co_trinket_m0.pid.1=0x001E

# Upload
penta_machine_co_trinket_m0.upload.tool=bossac18
penta_machine_co_trinket_m0.upload.protocol=sam-ba
penta_machine_co_trinket_m0.upload.maximum_size=262144
penta_machine_co_trinket_m0.upload.offset=0x2000
penta_machine_co_trinket_m0.upload.use_1200bps_touch=true
penta_machine_co_trinket_m0.upload.wait_for_upload_port=true
penta_machine_co_trinket_m0.upload.native_usb=true

# Build
penta_machine_co_trinket_m0.build.mcu=cortex-m0plus
penta_machine_co_trinket_m0.build.f_cpu=48000000L
penta_machine_co_trinket_m0.build.usb_product="Penta Machine Trinket M0"
penta_machine_co_trinket_m0.build.usb_manufacturer="Penta Machine CO."
penta_machine_co_trinket_m0.build.board=PENTA_TRINKET_M0
penta_machine_co_trinket_m0.build.core=arduino
penta_machine_co_trinket_m0.build.extra_flags=-D__SAMD21E18A__ -DCRYSTALLESS -DADAFRUIT_TRINKET_M0 -DARM_MATH_CM0PLUS {build.usb_flags}
penta_machine_co_trinket_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
penta_machine_co_trinket_m0.build.openocdscript=openocd_scripts/trinket_m0.cfg
penta_machine_co_trinket_m0.build.variant=trinket_m0
penta_machine_co_trinket_m0.build.variant_system_lib=
penta_machine_co_trinket_m0.build.vid=0x239A
penta_machine_co_trinket_m0.build.pid=0x801E
penta_machine_co_trinket_m0.bootloader.tool=openocd
penta_machine_co_trinket_m0.bootloader.file=trinketm0/bootloader-trinket_m0-v2.0.0-adafruit.5.bin

# Menu
penta_machine_co_trinket_m0.menu.opt.small=Small (-Os) (standard)
penta_machine_co_trinket_m0.menu.opt.small.build.flags.optimize=-Os
penta_machine_co_trinket_m0.menu.opt.fast=Fast (-O2)
penta_machine_co_trinket_m0.menu.opt.fast.build.flags.optimize=-O2
penta_machine_co_trinket_m0.menu.opt.faster=Faster (-O3)
penta_machine_co_trinket_m0.menu.opt.faster.build.flags.optimize=-O3
penta_machine_co_trinket_m0.menu.opt.fastest=Fastest (-Ofast)
penta_machine_co_trinket_m0.menu.opt.fastest.build.flags.optimize=-Ofast
penta_machine_co_trinket_m0.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
penta_machine_co_trinket_m0.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
penta_machine_co_trinket_m0.menu.usbstack.arduino=Arduino
penta_machine_co_trinket_m0.menu.usbstack.tinyusb=TinyUSB
penta_machine_co_trinket_m0.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
penta_machine_co_trinket_m0.menu.debug.off=Off
penta_machine_co_trinket_m0.menu.debug.on=On
penta_machine_co_trinket_m0.menu.debug.on.build.flags.debug=-g


# -----------------------------------
# Penta Machine CO. irda probe m0 M0 (SAMD21)
# -----------------------------------
penta_machine_co_irda_probe_m0.name=Penta Machine CO. IrDA Probe M0 (SAMD21)

# VID/PID for Bootloader, Arduino & CircuitPython
penta_machine_co_irda_probe_m0.vid.0=0x239A
penta_machine_co_irda_probe_m0.pid.0=0x801E
penta_machine_co_irda_probe_m0.vid.1=0x239A
penta_machine_co_irda_probe_m0.pid.1=0x001E

# Upload
penta_machine_co_irda_probe_m0.upload.tool=bossac18
penta_machine_co_irda_probe_m0.upload.protocol=sam-ba
penta_machine_co_irda_probe_m0.upload.maximum_size=262144
penta_machine_co_irda_probe_m0.upload.offset=0x2000
penta_machine_co_irda_probe_m0.upload.use_1200bps_touch=true
penta_machine_co_irda_probe_m0.upload.wait_for_upload_port=true
penta_machine_co_irda_probe_m0.upload.native_usb=true

# Build
penta_machine_co_irda_probe_m0.build.mcu=cortex-m0plus
penta_machine_co_irda_probe_m0.build.f_cpu=48000000L
penta_machine_co_irda_probe_m0.build.usb_product="Penta Machine Trinket M0"
penta_machine_co_irda_probe_m0.build.usb_manufacturer="Penta Machine CO."
penta_machine_co_irda_probe_m0.build.board=PENTA_IRDA_PROBE_M0
penta_machine_co_irda_probe_m0.build.core=arduino
penta_machine_co_irda_probe_m0.build.extra_flags=-D__SAMD21E18A__ -DCRYSTALLESS -DADAFRUIT_TRINKET_M0 -DARM_MATH_CM0PLUS {build.usb_flags}
penta_machine_co_irda_probe_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
penta_machine_co_irda_probe_m0.build.openocdscript=openocd_scripts/trinket_m0.cfg
penta_machine_co_irda_probe_m0.build.variant=irda_probe_m0
penta_machine_co_irda_probe_m0.build.variant_system_lib=
penta_machine_co_irda_probe_m0.build.vid=0x239A
penta_machine_co_irda_probe_m0.build.pid=0x801E
penta_machine_co_irda_probe_m0.bootloader.tool=openocd
penta_machine_co_irda_probe_m0.bootloader.file=trinketm0/bootloader-trinket_m0-v2.0.0-adafruit.5.bin

# Menu
penta_machine_co_irda_probe_m0.menu.opt.small=Small (-Os) (standard)
penta_machine_co_irda_probe_m0.menu.opt.small.build.flags.optimize=-Os
penta_machine_co_irda_probe_m0.menu.opt.fast=Fast (-O2)
penta_machine_co_irda_probe_m0.menu.opt.fast.build.flags.optimize=-O2
penta_machine_co_irda_probe_m0.menu.opt.faster=Faster (-O3)
penta_machine_co_irda_probe_m0.menu.opt.faster.build.flags.optimize=-O3
penta_machine_co_irda_probe_m0.menu.opt.fastest=Fastest (-Ofast)
penta_machine_co_irda_probe_m0.menu.opt.fastest.build.flags.optimize=-Ofast
penta_machine_co_irda_probe_m0.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
penta_machine_co_irda_probe_m0.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
penta_machine_co_irda_probe_m0.menu.usbstack.arduino=Arduino
penta_machine_co_irda_probe_m0.menu.usbstack.tinyusb=TinyUSB
penta_machine_co_irda_probe_m0.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
penta_machine_co_irda_probe_m0.menu.debug.off=Off
penta_machine_co_irda_probe_m0.menu.debug.on=On
penta_machine_co_irda_probe_m0.menu.debug.on.build.flags.debug=-g
